from environs import Env

env = Env()
env.read_env()
API_TOKEN = env.str("API_TOKEN")
PATH = '/Users/kyryl/Desktop/users.db'
ADMINS = env.list("ADMINS")
reg_exp = "(6|9|шестёрка|шестерка|девятка|шестерки|шестёрки|девятки|шестёрке|шестерке|" \
          "девятке|шестёрку|шестерку|девятку|шестёркой|шестеркой|девяткой|" \
          "шесть|девять|шести|девяти|шестью|девятью|" \
          "шестёрок|шестерок|девяток|шестёркам|шестеркам|девяткам|" \
          "шестёрками|шестерками|девятками|" \
          "шість|дев'ять|шести|шістьох|дев'яти|дев'ятьох|шістьом|дев'ятьом|" \
          "шістьма|шістьома|дев'ятьма|дев'ятьома|шестірка|дев'ятка|шестірки|дев'ятки|" \
          "шестірці|дев'ятці|шестірку|дев'ятку|шестіркою|дев'яткою|шестірко|дев'ятко|" \
          "шестірок|дев'яток|шестіркам|дев'яткам|шестірками|дев'ятками|шестірках|дев'ятках|" \
          "шістка|шістки|шістці|шістку|шісткою|шісточка|дев'яточка|шісточки|дев'яточки|шісточці|" \
          "дев'яточці|шісточку|дев'яточку|шісточкою|дев'яточкою)"
dictionary = {"6": "9", "9": "6", "шестёрка": "девятка", "шестерка": "девятка", "девятка": "шестёрка",
              "шестерки": "девятки", "шестёрки": "девятки", "девятки": "шестёрки", "шестёрке": "девятке",
              "шестерке": "девятке", "девятке": "шестёрке", "шестёрку": "девятку", "шестерку": "девятку",
              "девятку": "шестёрку", "шестёркой": "девяткой", "шестеркой": "девяткой", "девяткой": "шестёркой",
              "шесть": "девять", "девять": "шесть", "шести": "девяти", "девяти": "шести", "шестью": "девятью",
              "девятью": "шестью", "шестёрок": "девяток", "шестерок": "девяток", "девяток": "шестёрок",
              "шестёркам": "девяткам", "шестеркам": "девяткам", "девяткам": "шестёркам", "шестёрками": "девятками",
              "шестерками": "девятками", "девятками": "шестерками",
              "шість": "дев'ять", "дев'ять": "шість", "дев'яти": "шести", "шістьох": "дев'ятьох",
              "дев'ятьох": "шістьох", "шістьом": "дев'ятьом", "дев'ятьом": "шістьом", "шістьма": "дев'ятьма",
              "дев'ятьма": "шістьма", "шістьома": "дев'ятьома", "дев'ятьома": "шістьома",
              "шестірка": "дев'ятка", "дев'ятка": "шестірка", "шестірки": "дев'ятки", "дев'ятки": "шестірки",
              "шестірці": "дев'ятці", "дев'ятці": "шестірці", "шестірку": "дев'ятку", "дев'ятку": "шестірку",
              "шестіркою": "дев'яткою", "дев'яткою": "шестіркою", "шестірко": "дев'ятко", "дев'ятко": "шестірко",
              "шестірок": "дев'яток", "дев'яток": "шестірок", "шестіркам": "дев'яткам", "дев'яткам": "шестіркам",
              "шестірками": "дев'ятками", "дев'ятками": "шестірками", "шестірках": "дев'ятках",
              "дев'ятках": "шестірках", "шістка": "дев'ятка", "шістки": "дев'ятки", "шістці": "дев'ятці",
              "шістку": "дев'ятку", "шісткою": "дев'яткою",
              "шісточка": "дев'яточка", "дев'яточка": "шісточка", "шісточки": "дев'яточки", "дев'яточки": "шісточки",
              "шісточці": "дев'яточці", "дев'яточці": "шісточці", "шісточку": "дев'яточку", "дев'яточку": "шісточку",
              "шісточкою": "дев'яточкою", "дев'яточкою": "шісточкою"}


